SOAP/post.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.example.com/webservice">
    <soapenv:Header>
        <Token>eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJyb290IiwiaWF0IjoxNjk4MDU2NDIyLCJleHAiOjE2OTgxNDI4MjJ9.aiyfGnMMgMK002hzajTJBsFVUiWLgECAMDs7I6C2s50</Token>
    </soapenv:Header>
    <soapenv:Body>
        <web:CreateAdministratorRequest>
            <web:firstName>oussema</web:firstName>
            <web:lastName>afli</web:lastName>
            <web:email>manem99@gmail.com</web:email>
            <web:phoneNumber>123-456-7890</web:phoneNumber>
            <web:address>mourouj</web:address>
            <web:position>University Counsellor</web:position>
        </web:CreateAdministratorRequest>
    </soapenv:Body>
</soapenv:Envelope>
